/* This file is the descriptor for the Custom jython step polarize periodical feature */
{
    "meta" : {
        // label: name of the data prep step as displayed, should be short
        "label": "Custom processor polarize periodical feature",

        // description: longer string to help end users understand what this data prep step does
        "description": "This processor allows to project a periodical column values in a reversed trigonometric circle. \
Then you naturally get the argument of this column values on this reversed circle.\
Cosinus, sinus and tangent of this argument are computed to that you can intuitively analyse their values. This features take your phenomenon periodicity into account.\
The way to read the measure on the resulting trigonometric circle is then the same as the one to read a clock (it starts from the top and goes in the clockwise direction of roatation )\
zdaz\
    Example of periodical columns : \
    - 'Day of year' starts from 1 and goes toward 366 maximum : but the December 31st is really close to Janueary 1st.\
    - 'Day of month' starts from 1 and goes toward 31 maximum : but the last day of a given month is really close to se first one of the next month.\
    - 'Day of week' starts from 1 and goes toward 7 : but sunday really close to  monday.",

        // icon: must be one of the FontAwesome 3.2.1 icons, complete list here at https://fontawesome.com/v3.2.1/icons/
        "icon": "icon-circle-blank"
    },

    /*
     * the processor mode, dictating what output is expected:
     * - CELL : the code outputs a value
     * - ROW : the code outputs a row
     * - ROWS : the code outputs an array of rows
     */
    "mode": "CELL",

    /* params:
    DSS will generate a formular from this list of requested parameters.
    Your component code can then access the value provided by users using the "name" field of each parameter.

    Available parameter types include:
    STRING, INT, DOUBLE, BOOLEAN, DATE, SELECT, TEXTAREA, MAP, PRESET and others.

    For the full list and for more details, see the documentation: https://doc.dataiku.com/dss/latest/plugins/reference/params.html
    */
    "params": [
        {
            "name": "periodical_column",
            "label": "periodiclal column",
            "type": "COLUMN",
            "description": "The column containing a periodical information (ex: day of year, day of month, day of week, month....)",
            "mandatory": true
        },
        {
            "name": "column_period",
            "label":"column period",
            "type": "DOUBLE",
            "defaultValue" : 365.24,
            "description": "The period of the column containing the periodical information (ex: 365.24 for day of year, 30.43 for day of month, 7 for day of week,, 12 for month....)"
        }
    ]
}
